import {SkillNode} from '../interfaces/skill-node.interface';

export const Skills_DATA_SHARP: SkillNode[] = [
  {
    name: 'Простые игрына Unity',
    children: [
      {
        name:
          'Пробовал скопировать игру ' +
          'Stardew VAlley на юнити, но' +
          ' в определенное время просто перестал интересовать геймдев, ' +
          'но уже дане на этом этапе там было проделано дотаочно для начала разработки',
      },
    ],
  },
  {
    name: 'Боты для телеграм',
    children: [
      {
        name:
          'Достаточно тоже интересная задача была - создать бота, я решил сднлать сначала игрового бота. ' +
          'Я его сделал, потом я решил его переделать в торрент бота, я его почти доделал.. У меня простоне было желания искать готовые ссылки на торренты',
      },
    ],
  },
  {
    name: 'небольшие API на ASP.NET',
    children: [
      {
        name: 'Начал делвть апи для приложения e-commerce, но при реализации паттерна Repository оно просто перестало запускаться, я 3 дня искал в чем проблема, но так и не понял этого и роект был прекращен',
      },
    ],
  },
  {
    name: 'Парсинг данных с помощью библиотеки AngleSharp',
    children: [
      {
        name: 'Написал парсер статей из хабра с помощью этой либы, основанный на WinForms',
      },
    ],
  },
  {
    name: 'WPF',
    children: [
      {
        name: 'Написал 2 приложения: 1 являлось тестом возможностей WPF, второе приложением для резервации номеров в гостинице. Так же использовал EntityFramework для общения с базой данных',
      },
    ],
  },
];
export const WANNA_DATA_SHARP: SkillNode[] = [
  {
    name: 'Unity',
    children: [
      {
        name: 'Подробнее разобраться в системе скриптинга и UI',
      },
    ],
  },
  {
    name: 'ASP.NET',
    children: [
      {
        name: 'Более подробнее разобраться в работе данной платформы и разработать свой мессенджер, используя ее в качестве бэк-енда',
      },
    ],
  },
];
